MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAK169/mcu.h
extern volatile __DEVADC7bits_t DEVADC7bits __asm__ ("DEVADC7") __attribute__((section("sfrs"), address(0xBFC5401C)));
#define DEVSN0 DEVSN0
extern volatile uint32_t   DEVSN0 __attribute__((section("sfrs"), address(0xBFC54020)));
typedef union {
  struct {
    uint32_t SN:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVSN0bits_t;
extern volatile __DEVSN0bits_t DEVSN0bits __asm__ ("DEVSN0") __attribute__((section("sfrs"), address(0xBFC54020)));
#define DEVSN1 DEVSN1
extern volatile uint32_t   DEVSN1 __attribute__((section("sfrs"), address(0xBFC54024)));
typedef union {
  struct {
    uint32_t SN:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVSN1bits_t;
extern volatile __DEVSN1bits_t DEVSN1bits __asm__ ("DEVSN1") __attribute__((section("sfrs"), address(0xBFC54024)));
#define DEVSN2 DEVSN2
extern volatile uint32_t   DEVSN2 __attribute__((section("sfrs"), address(0xBFC54028)));
typedef union {
  struct {
    uint32_t SN:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVSN2bits_t;
extern volatile __DEVSN2bits_t DEVSN2bits __asm__ ("DEVSN2") __attribute__((section("sfrs"), address(0xBFC54028)));
#define DEVSN3 DEVSN3
extern volatile uint32_t   DEVSN3 __attribute__((section("sfrs"), address(0xBFC5402C)));
typedef union {
  struct {
    uint32_t SN:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVSN3bits_t;
extern volatile __DEVSN3bits_t DEVSN3bits __asm__ ("DEVSN3") __attribute__((section("sfrs"), address(0xBFC5402C)));
#define ADEVCFG4 ADEVCFG4
extern volatile uint32_t   ADEVCFG4 __attribute__((section("sfrs"), address(0xBFC0FF3C)));
typedef union {
  struct {
    uint32_t :24;
    uint32_t SWDTPS:5;
  };
  struct {
    uint32_t w:32;
  };
} __ADEVCFG4bits_t;
extern volatile __ADEVCFG4bits_t ADEVCFG4bits __asm__ ("ADEVCFG4") __attribute__((section("sfrs"), address(0xBFC0FF3C)));
#define ADEVCFG3 ADEVCFG3
extern volatile uint32_t   ADEVCFG3 __attribute__((section("sfrs"), address(0xBFC0FF40)));
typedef union {
  struct {
    uint32_t USERID:16;
    uint32_t :8;
    uint32_t FMIIEN:1;
    uint32_t FETHIO:1;
    uint32_t :1;
    uint32_t PGL1WAY:1;
    uint32_t PMDL1WAY:1;
    uint32_t IOL1WAY:1;
  };
  struct {
    uint32_t w:32;
  };
} __ADEVCFG3bits_t;
extern volatile __ADEVCFG3bits_t ADEVCFG3bits __asm__ ("ADEVCFG3") __attribute__((section("sfrs"), address(0xBFC0FF40)));
#define ADEVCFG2 ADEVCFG2
extern volatile uint32_t   ADEVCFG2 __attribute__((section("sfrs"), address(0xBFC0FF44)));
typedef union {
  struct {
    uint32_t FPLLIDIV:3;
    uint32_t :1;
    uint32_t FPLLRNG:3;
    uint32_t FPLLICLK:1;
    uint32_t FPLLMULT:7;
    uint32_t :1;
    uint32_t FPLLODIV:3;
    uint32_t VBATBOREN:1;
    uint32_t DSBOREN:1;
    uint32_t DSWDTPS:5;
    uint32_t DSWDTOSC:1;
    uint32_t DSWDTEN:1;
    uint32_t FDSEN:1;
    uint32_t :1;
    uint32_t UPLLFSEL:1;
  };
  struct {
    uint32_t w:32;
  };
} __ADEVCFG2bits_t;
extern volatile __ADEVCFG2bits_t ADEVCFG2bits __asm__ ("ADEVCFG2") __attribute__((section("sfrs"), address(0xBFC0FF44)));
#define ADEVCFG1 ADEVCFG1
extern volatile uint32_t   ADEVCFG1 __attribute__((section("sfrs"), address(0xBFC0FF48)));
typedef union {
  struct {
    uint32_t FNOSC:3;
    uint32_t DMTINTV:3;
    uint32_t FSOSCEN:1;
    uint32_t IESO:1;
    uint32_t POSCMOD:2;
    uint32_t OSCIOFNC:1;
    uint32_t :3;
    uint32_t FCKSM:2;
    uint32_t WDTPS:5;
    uint32_t WDTSPGM:1;
    uint32_t WINDIS:1;
    uint32_t FWDTEN:1;
    uint32_t FWDTWINSZ:2;
    uint32_t DMTCNT:5;
    uint32_t FDMTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __ADEVCFG1bits_t;
extern volatile __ADEVCFG1bits_t ADEVCFG1bits __asm__ ("ADEVCFG1") __attribute__((section("sfrs"), address(0xBFC0FF48)));
#define ADEVCFG0 ADEVCFG0
extern volatile uint32_t   ADEVCFG0 __attribute__((section("sfrs"), address(0xBFC0FF4C)));
typedef union {
  struct {
    uint32_t DEBUG:2;
    uint32_t JTAGEN:1;
    uint32_t ICESEL:2;
    uint32_t TRCEN:1;
    uint32_t BOOTISA:1;
    uint32_t :1;
    uint32_t FECCCON:2;
    uint32_t FSLEEP:1;
    uint32_t :1;
    uint32_t DBGPER:3;
    uint32_t SMCLR:1;
    uint32_t SOSCGAIN:2;
    uint32_t SOSCBOOST:1;
    uint32_t POSCGAIN:2;
    uint32_t POSCBOOST:1;
    uint32_t POSCFGAIN:2;
    uint32_t POSCTYPE:2;
    uint32_t POSCAGCRNG:1;
    uint32_t POSCAGC:1;
    uint32_t :2;
    uint32_t EJTAGBEN:1;
  };
  struct {
    uint32_t :24;
    uint32_t POSCAGCDLY:2;
  };
  struct {
    uint32_t FDEBUG:2;
  };
  struct {
    uint32_t w:32;
  };
} __ADEVCFG0bits_t;
extern volatile __ADEVCFG0bits_t ADEVCFG0bits __asm__ ("ADEVCFG0") __attribute__((section("sfrs"), address(0xBFC0FF4C)));
#define ADEVCP3 ADEVCP3
extern volatile uint32_t   ADEVCP3 __attribute__((section("sfrs"), address(0xBFC0FF50)));
#define ADEVCP2 ADEVCP2
extern volatile uint32_t   ADEVCP2 __attribute__((section("sfrs"), address(0xBFC0FF54)));
#define ADEVCP1 ADEVCP1
extern volatile uint32_t   ADEVCP1 __attribute__((section("sfrs"), address(0xBFC0FF58)));
#define ADEVCP0 ADEVCP0
extern volatile uint32_t   ADEVCP0 __attribute__((section("sfrs"), address(0xBFC0FF5C)));
typedef union {
  struct {
    uint32_t :28;
    uint32_t CP:1;
  };
  struct {
    uint32_t w:32;
  };
} __ADEVCP0bits_t;
extern volatile __ADEVCP0bits_t ADEVCP0bits __asm__ ("ADEVCP0") __attribute__((section("sfrs"), address(0xBFC0FF5C)));
#define ADEVSIGN3 ADEVSIGN3
extern volatile uint32_t   ADEVSIGN3 __attribute__((section("sfrs"), address(0xBFC0FF60)));
#define ADEVSIGN2 ADEVSIGN2
extern volatile uint32_t   ADEVSIGN2 __attribute__((section("sfrs"), address(0xBFC0FF64)));
#define ADEVSIGN1 ADEVSIGN1
extern volatile uint32_t   ADEVSIGN1 __attribute__((section("sfrs"), address(0xBFC0FF68)));
#define ADEVSIGN0 ADEVSIGN0
extern volatile uint32_t   ADEVSIGN0 __attribute__((section("sfrs"), address(0xBFC0FF6C)));
#define ASEQ3 ASEQ3
extern volatile uint32_t   ASEQ3 __attribute__((section("sfrs"), address(0xBFC0FF70)));
typedef union {
  struct {
    uint32_t TSEQ:16;
    uint32_t CSEQ:16;
  };
  struct {
    uint32_t w:32;
  };
} __ASEQ3bits_t;
extern volatile __ASEQ3bits_t ASEQ3bits __asm__ ("ASEQ3") __attribute__((section("sfrs"), address(0xBFC0FF70)));
#define ASEQ2 ASEQ2
extern volatile uint32_t   ASEQ2 __attribute__((section("sfrs"), address(0xBFC0FF74)));
#define ASEQ1 ASEQ1
extern volatile uint32_t   ASEQ1 __attribute__((section("sfrs"), address(0xBFC0FF78)));
#define ASEQ0 ASEQ0
extern volatile uint32_t   ASEQ0 __attribute__((section("sfrs"), address(0xBFC0FF7C)));
#define AUBADEVCFG4 AUBADEVCFG4
extern volatile uint32_t   AUBADEVCFG4 __attribute__((section("sfrs"), address(0xBFC2FF3C)));
typedef union {
  struct {
    uint32_t :24;
    uint32_t SWDTPS:5;
  };
  struct {
    uint32_t w:32;
  };
} __AUBADEVCFG4bits_t;
extern volatile __AUBADEVCFG4bits_t AUBADEVCFG4bits __asm__ ("AUBADEVCFG4") __attribute__((section("sfrs"), address(0xBFC2FF3C)));
#define AUBADEVCFG3 AUBADEVCFG3
extern volatile uint32_t   AUBADEVCFG3 __attribute__((section("sfrs"), address(0xBFC2FF40)));
typedef union {
  struct {
    uint32_t USERID:16;
    uint32_t :8;
    uint32_t FMIIEN:1;
    uint32_t FETHIO:1;
    uint32_t :1;
    uint32_t PGL1WAY:1;
    uint32_t PMDL1WAY:1;
    uint32_t IOL1WAY:1;
  };
  struct {
    uint32_t w:32;
  };
} __AUBADEVCFG3bits_t;
extern volatile __AUBADEVCFG3bits_t AUBADEVCFG3bits __asm__ ("AUBADEVCFG3") __attribute__((section("sfrs"), address(0xBFC2FF40)));
#define AUBADEVCFG2 AUBADEVCFG2
extern volatile uint32_t   AUBADEVCFG2 __attribute__((section("sfrs"), address(0xBFC2FF44)));
typedef union {
  struct {
    uint32_t FPLLIDIV:3;
    uint32_t :1;
    uint32_t FPLLRNG:3;
    uint32_t FPLLICLK:1;
    uint32_t FPLLMULT:7;
    uint32_t :1;
    uint32_t FPLLODIV:3;
    uint32_t VBATBOREN:1;
    uint32_t DSBOREN:1;
    uint32_t DSWDTPS:5;
    uint32_t DSWDTOSC:1;
    uint32_t DSWDTEN:1;
    uint32_t FDSEN:1;
    uint32_t :1;
    uint32_t UPLLFSEL:1;
  };
  struct {
    uint32_t w:32;
  };
} __AUBADEVCFG2bits_t;
