MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAK169/mcu.h
#define _GLCDMODE_LCDEN_POSITION                 0x0000001F
#define _GLCDMODE_LCDEN_MASK                     0x80000000
#define _GLCDMODE_LCDEN_LENGTH                   0x00000001

#define _GLCDCLKCON_CLKDIV_POSITION              0x00000000
#define _GLCDCLKCON_CLKDIV_MASK                  0x0000003F
#define _GLCDCLKCON_CLKDIV_LENGTH                0x00000006

#define _GLCDCLKCON_LPREFETCH_POSITION           0x00000008
#define _GLCDCLKCON_LPREFETCH_MASK               0x00003F00
#define _GLCDCLKCON_LPREFETCH_LENGTH             0x00000006

#define _GLCDBGCOLOR_ALPHA_POSITION              0x00000000
#define _GLCDBGCOLOR_ALPHA_MASK                  0x000000FF
#define _GLCDBGCOLOR_ALPHA_LENGTH                0x00000008

#define _GLCDBGCOLOR_BLUE_POSITION               0x00000008
#define _GLCDBGCOLOR_BLUE_MASK                   0x0000FF00
#define _GLCDBGCOLOR_BLUE_LENGTH                 0x00000008

#define _GLCDBGCOLOR_GREEN_POSITION              0x00000010
#define _GLCDBGCOLOR_GREEN_MASK                  0x00FF0000
#define _GLCDBGCOLOR_GREEN_LENGTH                0x00000008

#define _GLCDBGCOLOR_RED_POSITION                0x00000018
#define _GLCDBGCOLOR_RED_MASK                    0xFF000000
#define _GLCDBGCOLOR_RED_LENGTH                  0x00000008

#define _GLCDRES_RESY_POSITION                   0x00000000
#define _GLCDRES_RESY_MASK                       0x000007FF
#define _GLCDRES_RESY_LENGTH                     0x0000000B

#define _GLCDRES_RESX_POSITION                   0x00000010
#define _GLCDRES_RESX_MASK                       0x07FF0000
#define _GLCDRES_RESX_LENGTH                     0x0000000B

#define _GLCDFPORCH_FPORCHY_POSITION             0x00000000
#define _GLCDFPORCH_FPORCHY_MASK                 0x000007FF
#define _GLCDFPORCH_FPORCHY_LENGTH               0x0000000B

#define _GLCDFPORCH_FPORCHX_POSITION             0x00000010
#define _GLCDFPORCH_FPORCHX_MASK                 0x07FF0000
#define _GLCDFPORCH_FPORCHX_LENGTH               0x0000000B

#define _GLCDBLANKING_BLANKINGY_POSITION         0x00000000
#define _GLCDBLANKING_BLANKINGY_MASK             0x000007FF
#define _GLCDBLANKING_BLANKINGY_LENGTH           0x0000000B

#define _GLCDBLANKING_BLANKINGX_POSITION         0x00000010
#define _GLCDBLANKING_BLANKINGX_MASK             0x07FF0000
#define _GLCDBLANKING_BLANKINGX_LENGTH           0x0000000B

#define _GLCDBPORCH_BPORCHY_POSITION             0x00000000
#define _GLCDBPORCH_BPORCHY_MASK                 0x000007FF
#define _GLCDBPORCH_BPORCHY_LENGTH               0x0000000B

#define _GLCDBPORCH_BPORCHX_POSITION             0x00000010
#define _GLCDBPORCH_BPORCHX_MASK                 0x07FF0000
#define _GLCDBPORCH_BPORCHX_LENGTH               0x0000000B

#define _GLCDCURSOR_CURSORY_POSITION             0x00000000
#define _GLCDCURSOR_CURSORY_MASK                 0x000007FF
#define _GLCDCURSOR_CURSORY_LENGTH               0x0000000B

#define _GLCDCURSOR_CURSORX_POSITION             0x00000010
#define _GLCDCURSOR_CURSORX_MASK                 0x07FF0000
#define _GLCDCURSOR_CURSORX_LENGTH               0x0000000B

#define _GLCDL0MODE_COLORMODE_POSITION           0x00000000
#define _GLCDL0MODE_COLORMODE_MASK               0x0000000F
#define _GLCDL0MODE_COLORMODE_LENGTH             0x00000004

#define _GLCDL0MODE_SRCBLEND_POSITION            0x00000008
#define _GLCDL0MODE_SRCBLEND_MASK                0x00000F00
#define _GLCDL0MODE_SRCBLEND_LENGTH              0x00000004

#define _GLCDL0MODE_DESTBLEND_POSITION           0x0000000C
#define _GLCDL0MODE_DESTBLEND_MASK               0x0000F000
#define _GLCDL0MODE_DESTBLEND_LENGTH             0x00000004

#define _GLCDL0MODE_ALPHA_POSITION               0x00000010
#define _GLCDL0MODE_ALPHA_MASK                   0x00FF0000
#define _GLCDL0MODE_ALPHA_LENGTH                 0x00000008

#define _GLCDL0MODE_MULALPHA_POSITION            0x0000001C
#define _GLCDL0MODE_MULALPHA_MASK                0x10000000
#define _GLCDL0MODE_MULALPHA_LENGTH              0x00000001

#define _GLCDL0MODE_FORCEALPHA_POSITION          0x0000001D
#define _GLCDL0MODE_FORCEALPHA_MASK              0x20000000
#define _GLCDL0MODE_FORCEALPHA_LENGTH            0x00000001

#define _GLCDL0MODE_DISABIFIL_POSITION           0x0000001E
#define _GLCDL0MODE_DISABIFIL_MASK               0x40000000
#define _GLCDL0MODE_DISABIFIL_LENGTH             0x00000001

#define _GLCDL0MODE_LAYEREN_POSITION             0x0000001F
#define _GLCDL0MODE_LAYEREN_MASK                 0x80000000
#define _GLCDL0MODE_LAYEREN_LENGTH               0x00000001

#define _GLCDL0START_STARTY_POSITION             0x00000000
#define _GLCDL0START_STARTY_MASK                 0x000007FF
#define _GLCDL0START_STARTY_LENGTH               0x0000000B

#define _GLCDL0START_STARTX_POSITION             0x00000010
#define _GLCDL0START_STARTX_MASK                 0x07FF0000
#define _GLCDL0START_STARTX_LENGTH               0x0000000B

#define _GLCDL0SIZE_SIZEY_POSITION               0x00000000
#define _GLCDL0SIZE_SIZEY_MASK                   0x000007FF
#define _GLCDL0SIZE_SIZEY_LENGTH                 0x0000000B

#define _GLCDL0SIZE_SIZEX_POSITION               0x00000010
#define _GLCDL0SIZE_SIZEX_MASK                   0x07FF0000
#define _GLCDL0SIZE_SIZEX_LENGTH                 0x0000000B

#define _GLCDL0BADDR_BASEADDR_POSITION           0x00000000
#define _GLCDL0BADDR_BASEADDR_MASK               0xFFFFFFFF
#define _GLCDL0BADDR_BASEADDR_LENGTH             0x00000020

#define _GLCDL0STRIDE_STRIDE_POSITION            0x00000000
#define _GLCDL0STRIDE_STRIDE_MASK                0x0000FFFF
#define _GLCDL0STRIDE_STRIDE_LENGTH              0x00000010

#define _GLCDL0RES_RESY_POSITION                 0x00000000
#define _GLCDL0RES_RESY_MASK                     0x000007FF
#define _GLCDL0RES_RESY_LENGTH                   0x0000000B

#define _GLCDL0RES_RESX_POSITION                 0x00000010
#define _GLCDL0RES_RESX_MASK                     0x07FF0000
#define _GLCDL0RES_RESX_LENGTH                   0x0000000B

#define _GLCDL1MODE_COLORMODE_POSITION           0x00000000
#define _GLCDL1MODE_COLORMODE_MASK               0x0000000F
#define _GLCDL1MODE_COLORMODE_LENGTH             0x00000004

